[Killed] ConditionalExpression
src/core/format/priority.ts:41:39
 	if (m.source === "typescript") return m.code;
 	// Type system guarantees m.source is "eslint" or "biome" here
 	const ruleId = m.ruleId;
-	return typeof ruleId === "string" && ruleId.length > 0 ? ruleId : "unknown";
+	return typeof ruleId === "string" && true ? ruleId : "unknown";
 }
 
killedBy: ruleIdOfCore returns 'unknown' when ruleId is missing or empty
statusReason: expected '' to be 'unknown' // Object.is equality

[Killed] EqualityOperator
src/core/format/priority.ts:41:39
 	if (m.source === "typescript") return m.code;
 	// Type system guarantees m.source is "eslint" or "biome" here
 	const ruleId = m.ruleId;
-	return typeof ruleId === "string" && ruleId.length > 0 ? ruleId : "unknown";
+	return typeof ruleId === "string" && ruleId.length <= 0 ? ruleId : "unknown";
 }
 
killedBy: ruleIdOfCore returns ruleId for eslint/biome messages
statusReason: expected 'unknown' to be 'x/y' // Object.is equality

[Killed] StringLiteral
src/core/format/priority.ts:80:36
 	m: LintMessageWithFile,
 	ruleLevelMap: RuleLevelMapLike | null,
 ): string {
-	if (ruleLevelMap === null) return "Critical Compiler Errors";
+	if (ruleLevelMap === null) return "";
 
 	const ruleId = ruleIdOfCore(m);
killedBy: getPriorityName falls back to default name when map is null or no matching rules
statusReason: expected '' to be 'Critical Compiler Errors' // Object.is equality

[Killed] BlockStatement
src/core/format/priority.ts:122:26
 		const level = getPriorityLevel(m, ruleLevelMap);
 		const arr = byLevel.get(level);
 
-		if (arr === undefined) {
-			byLevel.set(level, [m]);
-		} else {
+		if (arr === undefined) {} else {
 			arr.push(m);
 		}
killedBy: groupByLevel groups by numeric level
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ArrayDeclaration
src/core/format/priority.ts:123:23
 		const arr = byLevel.get(level);
 
 		if (arr === undefined) {
-			byLevel.set(level, [m]);
+			byLevel.set(level, []);
 		} else {
 			arr.push(m);
killedBy: groupByLevel groups by numeric level
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/core/format/priority.ts:124:10
 
 		if (arr === undefined) {
 			byLevel.set(level, [m]);
-		} else {
-			arr.push(m);
-		}
+		} else {}
 
 		return byLevel;
killedBy: groupByLevel handles multiple messages with same level (else branch)
statusReason: expected 1 to be 3 // Object.is equality

[Survived] MethodExpression
src/core/format/priority.ts:161:13
 		// PURITY: CORE
 		// INVARIANT: ∀ messages: result.size <= 15
 		// COMPLEXITY: O(min(n, 15))
-		(msgs) => msgs.slice(0, 15),
+		(msgs) => msgs,
 		(topMsgs) =>
 			topMsgs.reduce((sections, m) => {

[Killed] BlockStatement
src/core/format/priority.ts:167:28
 				const section = getPriorityName(m, ruleLevelMap);
 				const arr = sections.get(section);
 
-				if (arr === undefined) {
-					sections.set(section, [m]);
-				} else {
+				if (arr === undefined) {} else {
 					arr.push(m);
 				}
killedBy: groupBySections groups sections by name for top 15 messages
statusReason: expected undefined to be 1 // Object.is equality

[Survived] BlockStatement
src/core/format/priority.ts:169:12
 
 				if (arr === undefined) {
 					sections.set(section, [m]);
-				} else {
-					arr.push(m);
-				}
+				} else {}
 
 				return sections;
