[Killed] BlockStatement
src/core/diff/column.ts:55:24
 	// QUOTE(SPEC): "visualColumn must be non-negative"
 	// REF: REQ-20250210-MODULAR-ARCH
 	// SOURCE: n/a
-	if (visualColumn < 0) {
-		throw new Error(
-			`visualColumn must be non-negative, received ${visualColumn}`,
-		);
-	}
+	if (visualColumn < 0) {}
 
 	let currentVisual = 0;
killedBy: computeRealColumnFromVisual throws for negative columns
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] EqualityOperator
src/core/diff/column.ts:55:6
 	// QUOTE(SPEC): "visualColumn must be non-negative"
 	// REF: REQ-20250210-MODULAR-ARCH
 	// SOURCE: n/a
-	if (visualColumn < 0) {
+	if (visualColumn >= 0) {
 		throw new Error(
 			`visualColumn must be non-negative, received ${visualColumn}`,
killedBy: computeRealColumnFromVisual returns 0 when cursor is at start
statusReason: Error: visualColumn must be non-negative, received 0

[Survived] StringLiteral
src/core/diff/column.ts:57:4
 	// SOURCE: n/a
 	if (visualColumn < 0) {
 		throw new Error(
-			`visualColumn must be non-negative, received ${visualColumn}`,
+			``,
 		);
 	}

[Killed] AssignmentOperator
src/core/diff/column.ts:66:51
 	// CHANGE: Loop through string plus one iteration to handle end-of-string case
 	// WHY: index <= length allows checking if visualColumn matches final position
 	// INVARIANT: Loop handles positions [0..length] where length is past last char
-	for (let index = 0; index <= lineContent.length; index += 1) {
+	for (let index = 0; index <= lineContent.length; index -= 1) {
 		// CHANGE: Early exit when we've reached or passed target
 		// WHY: Returns immediately when accumulated visual width reaches goal
killedBy: computeRealColumnFromVisual returns identical index for ASCII segments without tabs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ConditionalExpression
src/core/diff/column.ts:66:22
 	// CHANGE: Loop through string plus one iteration to handle end-of-string case
 	// WHY: index <= length allows checking if visualColumn matches final position
 	// INVARIANT: Loop handles positions [0..length] where length is past last char
-	for (let index = 0; index <= lineContent.length; index += 1) {
+	for (let index = 0; false; index += 1) {
 		// CHANGE: Early exit when we've reached or passed target
 		// WHY: Returns immediately when accumulated visual width reaches goal
killedBy: computeRealColumnFromVisual returns 0 when cursor is at start
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 3

[Killed] ConditionalExpression
src/core/diff/column.ts:70:7
 		// CHANGE: Early exit when we've reached or passed target
 		// WHY: Returns immediately when accumulated visual width reaches goal
 		// INVARIANT: visualColumn <= currentVisual ⇒ return index
-		if (visualColumn <= currentVisual) {
+		if (true) {
 			return index;
 		}
killedBy: computeRealColumnFromVisual returns identical index for ASCII segments without tabs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] EqualityOperator
src/core/diff/column.ts:70:7
 		// CHANGE: Early exit when we've reached or passed target
 		// WHY: Returns immediately when accumulated visual width reaches goal
 		// INVARIANT: visualColumn <= currentVisual ⇒ return index
-		if (visualColumn <= currentVisual) {
+		if (visualColumn < currentVisual) {
 			return index;
 		}
killedBy: computeRealColumnFromVisual returns 0 when cursor is at start
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] EqualityOperator
src/core/diff/column.ts:77:7
 		// CHANGE: Exact equality check kills >= vs > mutant
 		// WHY: index === length is boundary; > length never happens due to loop condition
 		// INVARIANT: index === length ⇒ no more chars to process
-		if (index === lineContent.length) {
+		if (index !== lineContent.length) {
 			break;
 		}
killedBy: computeRealColumnFromVisual returns identical index for ASCII segments without tabs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 4

[Killed] ConditionalExpression
src/core/diff/column.ts:77:7
 		// CHANGE: Exact equality check kills >= vs > mutant
 		// WHY: index === length is boundary; > length never happens due to loop condition
 		// INVARIANT: index === length ⇒ no more chars to process
-		if (index === lineContent.length) {
+		if (true) {
 			break;
 		}
killedBy: computeRealColumnFromVisual returns identical index for ASCII segments without tabs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 4

[Killed] ConditionalExpression
src/core/diff/column.ts:82:7
 		}
 
 		const char = lineContent[index];
-		if (char === "\t") {
+		if (false) {
 			const nextTabStop = Math.floor(currentVisual / tabSize + 1) * tabSize;
 			currentVisual = nextTabStop;
killedBy: computeRealColumnFromVisual stops inside a tab
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 3

[Killed] ConditionalExpression
src/core/diff/column.ts:82:7
 		}
 
 		const char = lineContent[index];
-		if (char === "\t") {
+		if (true) {
 			const nextTabStop = Math.floor(currentVisual / tabSize + 1) * tabSize;
 			currentVisual = nextTabStop;
killedBy: computeRealColumnFromVisual returns identical index for ASCII segments without tabs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ArithmeticOperator
src/core/diff/column.ts:83:24
 
 		const char = lineContent[index];
 		if (char === "\t") {
-			const nextTabStop = Math.floor(currentVisual / tabSize + 1) * tabSize;
+			const nextTabStop = Math.floor(currentVisual / tabSize + 1) / tabSize;
 			currentVisual = nextTabStop;
 		} else {
killedBy: computeRealColumnFromVisual stops inside a tab
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 3

[Killed] ArithmeticOperator
src/core/diff/column.ts:83:35
 
 		const char = lineContent[index];
 		if (char === "\t") {
-			const nextTabStop = Math.floor(currentVisual / tabSize + 1) * tabSize;
+			const nextTabStop = Math.floor(currentVisual * tabSize + 1) * tabSize;
 			currentVisual = nextTabStop;
 		} else {
killedBy: column invariants computeRealColumnFromVisual is a left inverse of visualColumnAt for every prefix
statusReason: Error: Property failed after 18 tests
{ seed: -1051258789, path: "17:2:1:6:5:4:5:4:5:5", endOnFailure: true }
Counterexample: ["\t\t\t",3,2]
Shrunk 9 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/core/diff/column.ts:85:10
 		if (char === "\t") {
 			const nextTabStop = Math.floor(currentVisual / tabSize + 1) * tabSize;
 			currentVisual = nextTabStop;
-		} else {
-			currentVisual += 1;
-		}
+		} else {}
 	}
 
killedBy: computeRealColumnFromVisual returns identical index for ASCII segments without tabs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 4

[Killed] AssignmentOperator
src/core/diff/column.ts:86:4
 			const nextTabStop = Math.floor(currentVisual / tabSize + 1) * tabSize;
 			currentVisual = nextTabStop;
 		} else {
-			currentVisual += 1;
+			currentVisual -= 1;
 		}
 	}
killedBy: computeRealColumnFromVisual returns identical index for ASCII segments without tabs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 4

[Killed] MethodExpression
src/core/diff/column.ts:120:28
 	tabWidth = TAB_WIDTH,
 ): number {
 	let column = 0;
-	const limit = Math.max(0, Math.min(index, content.length));
+	const limit = Math.max(0, Math.max(index, content.length));
 	for (let i = 0; i < limit; i += 1) {
 		const ch = content[i];
killedBy: visualColumnAt tracks visual width for ASCII-only prefixes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 4

[Killed] MethodExpression
src/core/diff/column.ts:120:16
 	tabWidth = TAB_WIDTH,
 ): number {
 	let column = 0;
-	const limit = Math.max(0, Math.min(index, content.length));
+	const limit = Math.min(0, Math.min(index, content.length));
 	for (let i = 0; i < limit; i += 1) {
 		const ch = content[i];
killedBy: visualColumnAt tracks visual width for ASCII-only prefixes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] ConditionalExpression
src/core/diff/column.ts:121:18
 ): number {
 	let column = 0;
 	const limit = Math.max(0, Math.min(index, content.length));
-	for (let i = 0; i < limit; i += 1) {
+	for (let i = 0; false; i += 1) {
 		const ch = content[i];
 		if (ch === "\t") {
killedBy: visualColumnAt tracks visual width for ASCII-only prefixes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] BlockStatement
src/core/diff/column.ts:121:37
 ): number {
 	let column = 0;
 	const limit = Math.max(0, Math.min(index, content.length));
-	for (let i = 0; i < limit; i += 1) {
-		const ch = content[i];
-		if (ch === "\t") {
-			const offset = tabWidth - (column % tabWidth);
-			column += offset;
-		} else {
-			column += 1;
-		}
-	}
+	for (let i = 0; i < limit; i += 1) {}
 	return column;
 }
killedBy: visualColumnAt tracks visual width for ASCII-only prefixes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] BlockStatement
src/core/diff/column.ts:123:20
 	const limit = Math.max(0, Math.min(index, content.length));
 	for (let i = 0; i < limit; i += 1) {
 		const ch = content[i];
-		if (ch === "\t") {
-			const offset = tabWidth - (column % tabWidth);
-			column += offset;
-		} else {
+		if (ch === "\t") {} else {
 			column += 1;
 		}
killedBy: visualColumnAt honors custom tab width offsets
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] ConditionalExpression
src/core/diff/column.ts:123:7
 	const limit = Math.max(0, Math.min(index, content.length));
 	for (let i = 0; i < limit; i += 1) {
 		const ch = content[i];
-		if (ch === "\t") {
+		if (true) {
 			const offset = tabWidth - (column % tabWidth);
 			column += offset;
killedBy: visualColumnAt tracks visual width for ASCII-only prefixes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 24

[Killed] ArithmeticOperator
src/core/diff/column.ts:124:31
 	for (let i = 0; i < limit; i += 1) {
 		const ch = content[i];
 		if (ch === "\t") {
-			const offset = tabWidth - (column % tabWidth);
+			const offset = tabWidth - (column * tabWidth);
 			column += offset;
 		} else {
killedBy: visualColumnAt clamps over-long indices to the last character boundary
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: 2

[Killed] ArithmeticOperator
src/core/diff/column.ts:124:19
 	for (let i = 0; i < limit; i += 1) {
 		const ch = content[i];
 		if (ch === "\t") {
-			const offset = tabWidth - (column % tabWidth);
+			const offset = tabWidth + column % tabWidth;
 			column += offset;
 		} else {
killedBy: visualColumnAt clamps over-long indices to the last character boundary
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: 11

[Killed] AssignmentOperator
src/core/diff/column.ts:125:4
 		const ch = content[i];
 		if (ch === "\t") {
 			const offset = tabWidth - (column % tabWidth);
-			column += offset;
+			column -= offset;
 		} else {
 			column += 1;
killedBy: visualColumnAt honors custom tab width offsets
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: -4

[Killed] BlockStatement
src/core/diff/column.ts:126:10
 		if (ch === "\t") {
 			const offset = tabWidth - (column % tabWidth);
 			column += offset;
-		} else {
-			column += 1;
-		}
+		} else {}
 	}
 	return column;
killedBy: visualColumnAt tracks visual width for ASCII-only prefixes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] AssignmentOperator
src/core/diff/column.ts:127:4
 			const offset = tabWidth - (column % tabWidth);
 			column += offset;
 		} else {
-			column += 1;
+			column -= 1;
 		}
 	}
killedBy: visualColumnAt tracks visual width for ASCII-only prefixes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: -3

[Killed] StringLiteral
src/core/diff/column.ts:152:15
  */
 export function expandTabs(content: string, tabWidth = TAB_WIDTH): string {
 	let column = 0;
-	let result = "";
+	let result = "Stryker was here!";
 	for (const ch of content) {
 		if (ch === "\t") {
killedBy: expandTabs replaces each tab with spaces up to the next stop without altering other characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a   b"
Received: "Stryker was here!a   b"

[Killed] BlockStatement
src/core/diff/column.ts:153:28
 export function expandTabs(content: string, tabWidth = TAB_WIDTH): string {
 	let column = 0;
 	let result = "";
-	for (const ch of content) {
-		if (ch === "\t") {
-			const spaces = tabWidth - (column % tabWidth);
-			result += " ".repeat(spaces);
-			column += spaces;
-		} else {
-			result += ch;
-			column += 1;
-		}
-	}
+	for (const ch of content) {}
 	return result;
 }
killedBy: expandTabs replaces each tab with spaces up to the next stop without altering other characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a   b"
Received: ""

[Killed] ConditionalExpression
src/core/diff/column.ts:154:7
 	let column = 0;
 	let result = "";
 	for (const ch of content) {
-		if (ch === "\t") {
+		if (false) {
 			const spaces = tabWidth - (column % tabWidth);
 			result += " ".repeat(spaces);
killedBy: expandTabs replaces each tab with spaces up to the next stop without altering other characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a   b"
Received: "a	b"

[Killed] BlockStatement
src/core/diff/column.ts:154:20
 	let column = 0;
 	let result = "";
 	for (const ch of content) {
-		if (ch === "\t") {
-			const spaces = tabWidth - (column % tabWidth);
-			result += " ".repeat(spaces);
-			column += spaces;
-		} else {
+		if (ch === "\t") {} else {
 			result += ch;
 			column += 1;
killedBy: expandTabs replaces each tab with spaces up to the next stop without altering other characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a   b"
Received: "ab"

[Killed] ArithmeticOperator
src/core/diff/column.ts:155:19
 	let result = "";
 	for (const ch of content) {
 		if (ch === "\t") {
-			const spaces = tabWidth - (column % tabWidth);
+			const spaces = tabWidth + column % tabWidth;
 			result += " ".repeat(spaces);
 			column += spaces;
killedBy: expandTabs replaces each tab with spaces up to the next stop without altering other characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a   b"
Received: "a     b"

[Killed] ArithmeticOperator
src/core/diff/column.ts:155:31
 	let result = "";
 	for (const ch of content) {
 		if (ch === "\t") {
-			const spaces = tabWidth - (column % tabWidth);
+			const spaces = tabWidth - (column * tabWidth);
 			result += " ".repeat(spaces);
 			column += spaces;
killedBy: expandTabs replaces each tab with spaces up to the next stop without altering other characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a   b"
Received: "ab"

[Killed] AssignmentOperator
src/core/diff/column.ts:157:4
 		if (ch === "\t") {
 			const spaces = tabWidth - (column % tabWidth);
 			result += " ".repeat(spaces);
-			column += spaces;
+			column -= spaces;
 		} else {
 			result += ch;
killedBy: column invariants expandTabs removes every tab while preserving total visual width
statusReason: Error: Property failed after 5 tests
{ seed: -1189592988, path: "4:1:8:5", endOnFailure: true }
Counterexample: ["\tz\t",2]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/core/diff/column.ts:158:10
 			const spaces = tabWidth - (column % tabWidth);
 			result += " ".repeat(spaces);
 			column += spaces;
-		} else {
-			result += ch;
-			column += 1;
-		}
+		} else {}
 	}
 	return result;
killedBy: expandTabs replaces each tab with spaces up to the next stop without altering other characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a   b"
Received: "    "

[Killed] AssignmentOperator
src/core/diff/column.ts:160:4
 			column += spaces;
 		} else {
 			result += ch;
-			column += 1;
+			column -= 1;
 		}
 	}
killedBy: expandTabs replaces each tab with spaces up to the next stop without altering other characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a   b"
Received: "a     b"
